package homework.hw6;

import java.util.Arrays;

public class Main {

    /*
     * Задание 1. Создайте программу на Python или Java, которая принимает два списка чисел и выполняет следующие действия:
     * a. Рассчитывает среднее значение каждого списка.
     * b. Сравнивает эти средние значения и выводит соответствующее сообщение:
     * - ""Первый список имеет большее среднее значение"", если среднее значение первого списка больше.
     * - ""Второй список имеет большее среднее значение"", если среднее значение второго списка больше.
     * - ""Средние значения равны"", если средние значения списков равны.
     */

//    public static void main(String[] args) {

//        NumbersList list1 = new NumbersList(Arrays.asList(2, 1, 0, 4, -15));
//        NumbersList list2 = new NumbersList(Arrays.asList(3, 2, 0, 3, -16));
//
//        NumListsProgram numListsProgram = new NumListsProgram(list1, list2);
//
//        double average1 = numListsProgram.calculateNumListAverage(list1);
//        double average2 = numListsProgram.calculateNumListAverage(list2);
//
//        String result = numListsProgram.twoListAverageCompare(average1, average2);
//        System.out.println(result);

//    }

}
